#pragma once

namespace gc {
const char* FieldCells[] = {
  "Поле вперёд",
  "Санкт Петербург",
  "Общественная казна",
  "Красноярск",
  "Подоходный налог",
  "Толмачёво",
  "Самара",
  "Шанс",
  "Чебоксары",
  "Пенза",
  "На экскурсии",
  "Челябинск",
  "Мобильная связь",
  "Барнаул",
  "Псков",
  "Пулково",
  "Батайск",
  "Общественная казна",
  "Воронеж",
  "Сыктывкар",
  "Бесплатная стоянка",
  "Ростов на Дону",
  "Шанс",
  "Рязань",
  "Москва",
  "Кольцово",
  "Архангельск",
  "Обнинск",
  "Интернет",
  "Новосибирск",
  "Тюрьма",
  "Северодвинск",
  "Курган",
  "Общественная казна",
  "Сургут",
  "Шереметьево",
  "Шанс",
  "Пермь",
  "Налог на роскошь",
  "Екатеринбург",
};

const uint8_t FieldSize = 40;

const uint16_t PlayerInitBalance = 15000; // k

const char *PlayerNames[] = {
  "Самолёт", "Бургер", "Телефон", "Скейт", "Марина", "Сенча", "Ульянча", "Матвейча"
};
}
